exports.data_ocupation = {
    "0": {
        "value": "0",
        "text": "選択なし",
        "data": {
            "text": "選択なし",
            "value": "0",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                }
            ]
        }
    },
    "1": {
        "value": "1",
        "text": "営業系",
        "data": {
            "text": "営業系",
            "value": "1",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "営業・企画営業・MR",
                    "value": "1",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "1",
                            "text": "法人営業"
                        },
                        {
                            "value": "2",
                            "text": "個人営業"
                        },
                        {
                            "value": "3",
                            "text": "内勤営業"
                        },
                        {
                            "value": "5",
                            "text": "ルートセールス・代理店営業"
                        },
                        {
                            "value": "6",
                            "text": "MR・MS"
                        },
                        {
                            "value": "7",
                            "text": "海外営業"
                        },
                        {
                            "value": "8",
                            "text": "その他営業関連職"
                        },
                        {
                            "value": "9",
                            "text": "コールセンター運営・管理"
                        },
                        {
                            "value": "11",
                            "text": "テレマーケティング"
                        },
                        {
                            "value": "334",
                            "text": "営業マネージャー・管理職"
                        }
                    ]
                },
                {
                    "text": "人材関連職",
                    "value": "3",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "12",
                            "text": "人材カウンセラー"
                        },
                        {
                            "value": "13",
                            "text": "派遣コーディネーター"
                        },
                        {
                            "value": "335",
                            "text": "その他の人材関連職"
                        }
                    ]
                }
            ]
        }
    },
    "2": {
        "value": "2",
        "text": "事務・経営管理系",
        "data": {
            "text": "事務・経営管理系",
            "value": "2",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "事務・受付・秘書",
                    "value": "4",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "4",
                            "text": "営業アシスタント"
                        },
                        {
                            "value": "10",
                            "text": "カスタマーサポート"
                        },
                        {
                            "value": "14",
                            "text": "一般事務"
                        },
                        {
                            "value": "15",
                            "text": "受付"
                        },
                        {
                            "value": "16",
                            "text": "秘書"
                        },
                        {
                            "value": "17",
                            "text": "その他の事務関連職"
                        },
                        {
                            "value": "336",
                            "text": "貿易、国際業務"
                        },
                        {
                            "value": "337",
                            "text": "物流、購買、資材調達"
                        }
                    ]
                },
                {
                    "text": "経理・財務",
                    "value": "5",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "18",
                            "text": "経理"
                        },
                        {
                            "value": "19",
                            "text": "財務"
                        }
                    ]
                },
                {
                    "text": "人事・総務",
                    "value": "6",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "20",
                            "text": "人事"
                        },
                        {
                            "value": "21",
                            "text": "総務"
                        }
                    ]
                },
                {
                    "text": "法務・知財",
                    "value": "7",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "22",
                            "text": "法務"
                        },
                        {
                            "value": "23",
                            "text": "知的財産・特許"
                        }
                    ]
                },
                {
                    "text": "広報・IR",
                    "value": "8",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "24",
                            "text": "広報"
                        },
                        {
                            "value": "25",
                            "text": "IR"
                        }
                    ]
                },
                {
                    "text": "その他の経営管理系",
                    "value": "60",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "338",
                            "text": "その他の経営管理系関連職"
                        }
                    ]
                }
            ]
        }
    },
    "3": {
        "value": "3",
        "text": "企画、マーケ、経営企画系",
        "data": {
            "text": "企画、マーケ、経営企画系",
            "value": "3",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "経営企画・事業開発",
                    "value": "9",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "26",
                            "text": "経営企画"
                        },
                        {
                            "value": "27",
                            "text": "新規事業・事業開発"
                        },
                        {
                            "value": "28",
                            "text": "その他経営企画関連職"
                        }
                    ]
                },
                {
                    "text": "マーケティング・企画",
                    "value": "10",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "29",
                            "text": "販促企画・営業企画"
                        },
                        {
                            "value": "30",
                            "text": "広告・宣伝・プロモーション"
                        },
                        {
                            "value": "31",
                            "text": "Webマーケティング(SEO・SEM)"
                        },
                        {
                            "value": "32",
                            "text": "リサーチ・市場調査"
                        },
                        {
                            "value": "33",
                            "text": "ブランド・プロダクトマーケティング"
                        },
                        {
                            "value": "34",
                            "text": "その他のマーケティング・企画関連職"
                        },
                        {
                            "value": "339",
                            "text": "商品企画"
                        },
                        {
                            "value": "340",
                            "text": "マーケティング・企画系管理職"
                        }
                    ]
                }
            ]
        }
    },
    "4": {
        "value": "4",
        "text": "販売・サービス系",
        "data": {
            "text": "販売・サービス系",
            "value": "4",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "ファッション(アパレル)関連",
                    "value": "11",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "35",
                            "text": "販売・接客スタッフ(ファッション関連)"
                        },
                        {
                            "value": "36",
                            "text": "店長・店長候補(ファッション関連)"
                        },
                        {
                            "value": "37",
                            "text": "スーパーバイザー・エリアマネージャ(ファッション関連)"
                        },
                        {
                            "value": "38",
                            "text": "店舗開発(ファッション関連)"
                        },
                        {
                            "value": "39",
                            "text": "マーチャンダイザー・バイヤー(ファッション関連)"
                        },
                        {
                            "value": "199",
                            "text": "ファッションデザイナー"
                        },
                        {
                            "value": "200",
                            "text": "テキスタイルデザイナー"
                        },
                        {
                            "value": "201",
                            "text": "アクセサリーデザイナー"
                        },
                        {
                            "value": "202",
                            "text": "パタンナー"
                        },
                        {
                            "value": "203",
                            "text": "ソーイングスタッフ"
                        },
                        {
                            "value": "341",
                            "text": "その他のファッション関連職"
                        }
                    ]
                },
                {
                    "text": "小売り",
                    "value": "12",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "40",
                            "text": "販売・接客スタッフ(小売り)"
                        },
                        {
                            "value": "41",
                            "text": "店長・店長候補(小売り)"
                        },
                        {
                            "value": "42",
                            "text": "スーパーバイザー・エリアマネージャ(小売り)"
                        },
                        {
                            "value": "43",
                            "text": "店舗開発(小売り)"
                        },
                        {
                            "value": "44",
                            "text": "マーチャンダイザー・バイヤー(小売り)"
                        },
                        {
                            "value": "45",
                            "text": "生産管理・品質管理(小売り)"
                        },
                        {
                            "value": "342",
                            "text": "その他の小売り関連職"
                        }
                    ]
                },
                {
                    "text": "その他サービス関連職",
                    "value": "13",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "46",
                            "text": "アミューズメント関連職"
                        },
                        {
                            "value": "47",
                            "text": "旅行サービス関連職"
                        },
                        {
                            "value": "48",
                            "text": "ホテル・宿泊施設サービス関連職"
                        },
                        {
                            "value": "49",
                            "text": "ブライダルサービス関連職"
                        },
                        {
                            "value": "343",
                            "text": "その他のサービス関連職"
                        }
                    ]
                }
            ]
        }
    },
    "5": {
        "value": "5",
        "text": "飲食・フード系",
        "data": {
            "text": "飲食・フード系",
            "value": "5",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "店長・店長候補",
                    "value": "14",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "50",
                            "text": "レストラン・専門料理店(店長・店長候補)"
                        },
                        {
                            "value": "61",
                            "text": "ファーストフード・ファミリーレストラン(店長・店長候補)"
                        },
                        {
                            "value": "63",
                            "text": "居酒屋・BAR(店長・店長候補)"
                        },
                        {
                            "value": "64",
                            "text": "カフェ・喫茶店(店長・店長候補)"
                        },
                        {
                            "value": "344",
                            "text": "その他の店長・店長候補関連職"
                        }
                    ]
                },
                {
                    "text": "接客・販売・ホール",
                    "value": "16",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "82",
                            "text": "レストラン・専門料理店(接客・販売・ホール)"
                        },
                        {
                            "value": "93",
                            "text": "ファーストフード・ファミリーレストラン(接客・販売・ホール)"
                        },
                        {
                            "value": "95",
                            "text": "居酒屋・BAR(接客・販売・ホール)"
                        },
                        {
                            "value": "96",
                            "text": "カフェ・喫茶店(接客・販売・ホール)"
                        },
                        {
                            "value": "345",
                            "text": "その他の接客・販売・ホール関連職"
                        }
                    ]
                },
                {
                    "text": "調理スタッフ・料理長",
                    "value": "17",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "99",
                            "text": "レストラン・専門料理店(調理スタッフ・料理長)"
                        },
                        {
                            "value": "110",
                            "text": "ファーストフード・ファミリーレストラン(調理スタッフ・料理長)"
                        },
                        {
                            "value": "112",
                            "text": "居酒屋・BAR(調理スタッフ・料理長)"
                        },
                        {
                            "value": "113",
                            "text": "カフェ・喫茶店(調理スタッフ・料理長)"
                        },
                        {
                            "value": "346",
                            "text": "その他の調理スタッフ・料理長関連職"
                        }
                    ]
                },
                {
                    "text": "スーパーバイザー・エリアマネージャ(飲食系)",
                    "value": "18",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "116",
                            "text": "レストラン・専門料理店(スーパーバイザー・エリアマネージャ)"
                        },
                        {
                            "value": "127",
                            "text": "ファーストフード・ファミリーレストラン(スーパーバイザー・エリアマネージャ)"
                        },
                        {
                            "value": "129",
                            "text": "居酒屋・BAR(スーパーバイザー・エリアマネージャ)"
                        },
                        {
                            "value": "130",
                            "text": "カフェ・喫茶店(スーパーバイザー・エリアマネージャ)"
                        },
                        {
                            "value": "347",
                            "text": "その他のスーパーバイザー・エリアマネージャ関連職"
                        }
                    ]
                },
                {
                    "text": "その他の飲食・フード系関連職",
                    "value": "27",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "139",
                            "text": "その他の飲食・フード関連職"
                        },
                        {
                            "value": "353",
                            "text": "レストラン・専門料理店(その他の飲食・フード)"
                        },
                        {
                            "value": "354",
                            "text": "ファーストフード・ファミリーレストラン(その他の飲食・フード)"
                        },
                        {
                            "value": "355",
                            "text": "居酒屋・BAR(その他の飲食・フード)"
                        },
                        {
                            "value": "356",
                            "text": "カフェ・喫茶店(その他の飲食・フード)"
                        }
                    ]
                },
                {
                    "text": "店舗開発(飲食・フード系)",
                    "value": "61",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "348",
                            "text": "レストラン・専門料理店(店舗開発)"
                        },
                        {
                            "value": "349",
                            "text": "ファーストフード・ファミリーレストラン(店舗開発)"
                        },
                        {
                            "value": "350",
                            "text": "居酒屋・BAR(店舗開発)"
                        },
                        {
                            "value": "351",
                            "text": "カフェ・喫茶店(店舗開発)"
                        },
                        {
                            "value": "352",
                            "text": "その他の店舗開発(飲食・フード系)関連職"
                        }
                    ]
                }
            ]
        }
    },
    "6": {
        "value": "6",
        "text": "ビューティー系",
        "data": {
            "text": "ビューティー系",
            "value": "6",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "理美容",
                    "value": "28",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "140",
                            "text": "美容師"
                        },
                        {
                            "value": "141",
                            "text": "理容師"
                        },
                        {
                            "value": "357",
                            "text": "スタイリスト・ヘアメイク"
                        },
                        {
                            "value": "358",
                            "text": "その他の理美容関連職"
                        }
                    ]
                },
                {
                    "text": "エステ・ネイル関連",
                    "value": "29",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "142",
                            "text": "エステティシャン"
                        },
                        {
                            "value": "143",
                            "text": "セラピスト"
                        },
                        {
                            "value": "144",
                            "text": "リフレクソロジスト"
                        },
                        {
                            "value": "145",
                            "text": "ネイリスト"
                        },
                        {
                            "value": "146",
                            "text": "その他のエステ・ネイル関連職"
                        }
                    ]
                },
                {
                    "text": "マッサージ関連",
                    "value": "30",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "147",
                            "text": "きゅう師"
                        },
                        {
                            "value": "148",
                            "text": "はり師"
                        },
                        {
                            "value": "149",
                            "text": "あん摩マッサージ指圧師"
                        },
                        {
                            "value": "150",
                            "text": "柔道整復師"
                        },
                        {
                            "value": "151",
                            "text": "その他のマッサージ関連職"
                        }
                    ]
                }
            ]
        }
    },
    "7": {
        "value": "7",
        "text": "技術系(IT・通信)",
        "data": {
            "text": "技術系(IT・通信)",
            "value": "7",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "システム開発(オープン・WEB系)",
                    "value": "31",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "152",
                            "text": "プログラマ(オープン・WEB系)"
                        },
                        {
                            "value": "153",
                            "text": "アプリケーション設計(オープン・WEB系)"
                        },
                        {
                            "value": "154",
                            "text": "プロジェクトマネージャ(オープン・WEB系)"
                        },
                        {
                            "value": "158",
                            "text": "データベース設計・構築・運用・保守(オープン・WEB系)"
                        },
                        {
                            "value": "159",
                            "text": "その他のシステム開発(オープン・WEB系)関連職"
                        }
                    ]
                },
                {
                    "text": "汎用機・制御開発関連",
                    "value": "32",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "160",
                            "text": "プログラマ(汎用機・制御系)"
                        },
                        {
                            "value": "161",
                            "text": "アプリケーション設計(汎用機・制御系)"
                        },
                        {
                            "value": "162",
                            "text": "プロジェクトマネージャ(汎用機・制御系)"
                        },
                        {
                            "value": "165",
                            "text": "データベース設計・構築・運用・保守(汎用機・制御系)"
                        },
                        {
                            "value": "166",
                            "text": "その他の汎用機・制御開発関連"
                        }
                    ]
                },
                {
                    "text": "その他のシステム・ソフトウェア関連職",
                    "value": "33",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "167",
                            "text": "社内SE"
                        },
                        {
                            "value": "168",
                            "text": "ITコンサルタント"
                        },
                        {
                            "value": "169",
                            "text": "セールスエンジニア・プリセールス"
                        },
                        {
                            "value": "332",
                            "text": "テクニカルサポート"
                        },
                        {
                            "value": "333",
                            "text": "プロジェクトマネージャ(その他のシステム・ソフトウェア関連職)"
                        },
                        {
                            "value": "360",
                            "text": "パッケージソフト・ミドルウェア・OS開発"
                        },
                        {
                            "value": "361",
                            "text": "プログラマ(その他のシステム・ソフトウェア関連職)"
                        },
                        {
                            "value": "362",
                            "text": "その他のシステム・ソフトフェア関連職"
                        }
                    ]
                },
                {
                    "text": "ネットワーク・通信インフラ系",
                    "value": "62",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "155",
                            "text": "通信インフラ設計・構築・運用・保守"
                        },
                        {
                            "value": "156",
                            "text": "ネットワーク・サーバー設計・構築・運用・保守"
                        },
                        {
                            "value": "359",
                            "text": "その他のネットワーク・通信インフラ関連職"
                        }
                    ]
                }
            ]
        }
    },
    "8": {
        "value": "8",
        "text": "クリエイティブ系",
        "data": {
            "text": "クリエイティブ系",
            "value": "8",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "WEBデザイン・WEB企画",
                    "value": "34",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "170",
                            "text": "WEBデザイナー"
                        },
                        {
                            "value": "172",
                            "text": "HTMLコーダー"
                        },
                        {
                            "value": "173",
                            "text": "WEBプロデューサー・WEBディレクター"
                        },
                        {
                            "value": "174",
                            "text": "WEB編集・コンテンツ企画"
                        },
                        {
                            "value": "175",
                            "text": "その他のWEB関連職"
                        }
                    ]
                },
                {
                    "text": "広告・グラフィック",
                    "value": "35",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "176",
                            "text": "クリエイティブディレクター"
                        },
                        {
                            "value": "177",
                            "text": "アートディレクター"
                        },
                        {
                            "value": "178",
                            "text": "コピーライター（広告・グラフィック）"
                        },
                        {
                            "value": "179",
                            "text": "グラフィックデザイナー"
                        },
                        {
                            "value": "180",
                            "text": "フォトグラファー"
                        },
                        {
                            "value": "181",
                            "text": "イラストレーター"
                        },
                        {
                            "value": "182",
                            "text": "DTPオペレーター"
                        },
                        {
                            "value": "183",
                            "text": "その他の広告・グラフィック関連職"
                        },
                        {
                            "value": "363",
                            "text": "進行管理"
                        }
                    ]
                },
                {
                    "text": "映像・音響・イベント・芸能",
                    "value": "36",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "184",
                            "text": "プロデューサー・AP"
                        },
                        {
                            "value": "185",
                            "text": "ディレクター・AD"
                        },
                        {
                            "value": "186",
                            "text": "脚本家・放送作家・監督・演出"
                        },
                        {
                            "value": "187",
                            "text": "制作・技術"
                        },
                        {
                            "value": "188",
                            "text": "進行"
                        },
                        {
                            "value": "189",
                            "text": "アナウンサー・俳優・モデル"
                        },
                        {
                            "value": "190",
                            "text": "芸能マネージャー"
                        },
                        {
                            "value": "191",
                            "text": "その他の映像・音響・イベント・芸能関連職"
                        }
                    ]
                },
                {
                    "text": "ゲーム・マルチメディア",
                    "value": "37",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "192",
                            "text": "ゲームプロデューサー・ディレクター"
                        },
                        {
                            "value": "193",
                            "text": "ゲームプランナー"
                        },
                        {
                            "value": "194",
                            "text": "ゲームプログラマ"
                        },
                        {
                            "value": "195",
                            "text": "CGデザイナー"
                        },
                        {
                            "value": "197",
                            "text": "サウンドクリエイター"
                        },
                        {
                            "value": "198",
                            "text": "その他のゲーム・マルチメディア関連職"
                        }
                    ]
                },
                {
                    "text": "インテリア・工業製品",
                    "value": "38",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "204",
                            "text": "店舗設計・インテリアコーディネーター・インテリアデザイナー"
                        },
                        {
                            "value": "205",
                            "text": "工業デザイナー・モデラー"
                        },
                        {
                            "value": "206",
                            "text": "その他インテリア・工業製品関連職"
                        }
                    ]
                },
                {
                    "text": "出版・印刷関連",
                    "value": "39",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "207",
                            "text": "編集者"
                        },
                        {
                            "value": "208",
                            "text": "カメラマン（男女）"
                        },
                        {
                            "value": "209",
                            "text": "校正"
                        },
                        {
                            "value": "210",
                            "text": "記者・ライター"
                        },
                        {
                            "value": "211",
                            "text": "翻訳"
                        },
                        {
                            "value": "213",
                            "text": "その他の出版・印刷関連職"
                        }
                    ]
                }
            ]
        }
    },
    "9": {
        "value": "9",
        "text": "建築・土木系",
        "data": {
            "text": "建築・土木系",
            "value": "9",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "建築・土木関連",
                    "value": "40",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "214",
                            "text": "設計"
                        },
                        {
                            "value": "215",
                            "text": "積算"
                        },
                        {
                            "value": "216",
                            "text": "測量"
                        },
                        {
                            "value": "217",
                            "text": "施工管理"
                        },
                        {
                            "value": "218",
                            "text": "CADオペレーター(建築・製図)"
                        },
                        {
                            "value": "219",
                            "text": "大工"
                        },
                        {
                            "value": "220",
                            "text": "とび職"
                        },
                        {
                            "value": "221",
                            "text": "土木作業員"
                        },
                        {
                            "value": "222",
                            "text": "その他の建築・土木関連職"
                        },
                        {
                            "value": "364",
                            "text": "コンサルタント(建築・土木関連)"
                        },
                        {
                            "value": "365",
                            "text": "技術開発・構造解析・特許・調査"
                        },
                        {
                            "value": "366",
                            "text": "設備工事"
                        }
                    ]
                }
            ]
        }
    },
    "10": {
        "value": "10",
        "text": "製造・設備・運輸系",
        "data": {
            "text": "製造・設備・運輸系",
            "value": "10",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "製造関連",
                    "value": "41",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "223",
                            "text": "技能工(整備・メカニック)"
                        },
                        {
                            "value": "224",
                            "text": "技能工(加工・溶接)"
                        },
                        {
                            "value": "367",
                            "text": "技能工(その他)"
                        }
                    ]
                },
                {
                    "text": "運輸・配送・倉庫",
                    "value": "42",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "225",
                            "text": "運輸関連"
                        },
                        {
                            "value": "226",
                            "text": "ドライバー・配送関連"
                        },
                        {
                            "value": "227",
                            "text": "倉庫関連"
                        },
                        {
                            "value": "368",
                            "text": "その他運輸・配送・倉庫関連職"
                        }
                    ]
                },
                {
                    "text": "警備・清掃・設備管理",
                    "value": "43",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "228",
                            "text": "警備・守衛"
                        },
                        {
                            "value": "229",
                            "text": "清掃スタッフ"
                        },
                        {
                            "value": "230",
                            "text": "ビル施設管理"
                        },
                        {
                            "value": "369",
                            "text": "その他の警備・清掃・設備管理関連職"
                        }
                    ]
                },
                {
                    "text": "農林水産関連",
                    "value": "44",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "231",
                            "text": "農林水産関連"
                        },
                        {
                            "value": "370",
                            "text": "その他の農林水産関連職"
                        }
                    ]
                }
            ]
        }
    },
    "11": {
        "value": "11",
        "text": "技術系(電気電子・機械・半導体)",
        "data": {
            "text": "技術系(電気電子・機械・半導体)",
            "value": "11",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "機械関連",
                    "value": "45",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "232",
                            "text": "研究・開発(機械)"
                        },
                        {
                            "value": "233",
                            "text": "機械・機構設計、金型設計(機械)"
                        },
                        {
                            "value": "234",
                            "text": "実装設計(機械)"
                        },
                        {
                            "value": "235",
                            "text": "制御設計(機械)"
                        },
                        {
                            "value": "236",
                            "text": "CAD(機械)"
                        },
                        {
                            "value": "238",
                            "text": "生産技術(機械)"
                        },
                        {
                            "value": "239",
                            "text": "生産管理・品質管理(機械)"
                        },
                        {
                            "value": "240",
                            "text": "購買・調達(機械)"
                        },
                        {
                            "value": "241",
                            "text": "その他の機械関連職"
                        },
                        {
                            "value": "371",
                            "text": "評価・テスト(機械)"
                        },
                        {
                            "value": "372",
                            "text": "セールスエンジニア・サービスエンジニア(機械)"
                        }
                    ]
                },
                {
                    "text": "電気・電子関連",
                    "value": "46",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "242",
                            "text": "研究・開発(電気・電子)"
                        },
                        {
                            "value": "243",
                            "text": "回路設計・実装設計"
                        },
                        {
                            "value": "244",
                            "text": "電子部品設計"
                        },
                        {
                            "value": "245",
                            "text": "光学技術"
                        },
                        {
                            "value": "246",
                            "text": "制御設計(電気・電子)"
                        },
                        {
                            "value": "247",
                            "text": "生産技術・生産管理・プロセス開発(電気・電子)"
                        },
                        {
                            "value": "248",
                            "text": "品質管理・品質保証(電気・電子)"
                        },
                        {
                            "value": "249",
                            "text": "その他の電気/電子関連職"
                        },
                        {
                            "value": "373",
                            "text": "評価・テスト(電気・電子)"
                        },
                        {
                            "value": "374",
                            "text": "セールスエンジニア・サービスエンジニア(電気・電子)"
                        }
                    ]
                },
                {
                    "text": "半導体関連",
                    "value": "47",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "250",
                            "text": "研究・開発(半導体)"
                        },
                        {
                            "value": "251",
                            "text": "デジタルＩＣ設計"
                        },
                        {
                            "value": "252",
                            "text": "アナログＩＣ設計"
                        },
                        {
                            "value": "253",
                            "text": "システムLSI設計"
                        },
                        {
                            "value": "254",
                            "text": "パッケージ開発"
                        },
                        {
                            "value": "255",
                            "text": "生産技術・生産管理・プロセス開発(半導体)"
                        },
                        {
                            "value": "256",
                            "text": "品質管理・品質保証(半導体)"
                        },
                        {
                            "value": "257",
                            "text": "その他の半導体関連職"
                        },
                        {
                            "value": "375",
                            "text": "評価・テスト(半導体)"
                        },
                        {
                            "value": "376",
                            "text": "FAE"
                        }
                    ]
                }
            ]
        }
    },
    "12": {
        "value": "12",
        "text": "技術系(医薬・食品・素材)",
        "data": {
            "text": "技術系(医薬・食品・素材)",
            "value": "12",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "医薬・医療機器",
                    "value": "48",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "258",
                            "text": "研究・開発（医薬）"
                        },
                        {
                            "value": "259",
                            "text": "臨床開発(CRA・DM・PMS等)"
                        },
                        {
                            "value": "260",
                            "text": "生産技術（医薬）"
                        },
                        {
                            "value": "261",
                            "text": "薬事申請"
                        },
                        {
                            "value": "262",
                            "text": "生産管理・品質管理(医薬)"
                        },
                        {
                            "value": "263",
                            "text": "その他の医薬・医療機器関連職"
                        },
                        {
                            "value": "377",
                            "text": "テクニカルサポート(医薬)"
                        }
                    ]
                },
                {
                    "text": "食品・化粧品",
                    "value": "49",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "264",
                            "text": "研究・開発(食品・化粧品)"
                        },
                        {
                            "value": "265",
                            "text": "生産技術・生産管理（食品・化粧品）"
                        },
                        {
                            "value": "266",
                            "text": "品質管理・品質保証（食品・化粧品）"
                        },
                        {
                            "value": "267",
                            "text": "研究開発（食品・化粧品）"
                        },
                        {
                            "value": "268",
                            "text": "その他の食品・化粧品関連職"
                        },
                        {
                            "value": "378",
                            "text": "セールスエンジニア・テクニカルサポート(食品・化粧品)"
                        }
                    ]
                },
                {
                    "text": "素材・化成品",
                    "value": "50",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "269",
                            "text": "研究・開発（素材・化成品）"
                        },
                        {
                            "value": "270",
                            "text": "生産技術・生産管理（素材・化成品）"
                        },
                        {
                            "value": "271",
                            "text": "品質管理・品質保証（素材・化成品）"
                        },
                        {
                            "value": "273",
                            "text": "その他の素材・化成品関連職"
                        },
                        {
                            "value": "379",
                            "text": "セールスエンジニア・テクニカルサポート(素材・化成品)"
                        }
                    ]
                },
                {
                    "text": "その他技術系(医薬・食品・素材)",
                    "value": "63",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "380",
                            "text": "その他技術系(医薬・食品・素材)関連職"
                        }
                    ]
                }
            ]
        }
    },
    "13": {
        "value": "13",
        "text": "医療・福祉・保育系",
        "data": {
            "text": "医療・福祉・保育系",
            "value": "13",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "医療",
                    "value": "51",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "274",
                            "text": "医師"
                        },
                        {
                            "value": "275",
                            "text": "看護師・准看護師・看護助手"
                        },
                        {
                            "value": "278",
                            "text": "医療事務"
                        },
                        {
                            "value": "279",
                            "text": "助産師"
                        },
                        {
                            "value": "280",
                            "text": "保健師"
                        },
                        {
                            "value": "281",
                            "text": "薬剤師"
                        },
                        {
                            "value": "282",
                            "text": "臨床検査士"
                        },
                        {
                            "value": "283",
                            "text": "歯科助手・歯科衛生士"
                        },
                        {
                            "value": "285",
                            "text": "歯科技工士"
                        },
                        {
                            "value": "286",
                            "text": "カウンセラー・臨床心理士"
                        },
                        {
                            "value": "287",
                            "text": "作業療法士(OT)"
                        },
                        {
                            "value": "288",
                            "text": "理学療法士(PT)"
                        },
                        {
                            "value": "289",
                            "text": "その他の医療サービス関連職"
                        }
                    ]
                },
                {
                    "text": "福祉",
                    "value": "52",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "290",
                            "text": "ヘルパー"
                        },
                        {
                            "value": "291",
                            "text": "介護福祉士"
                        },
                        {
                            "value": "292",
                            "text": "社会福祉士"
                        },
                        {
                            "value": "293",
                            "text": "生活相談員"
                        },
                        {
                            "value": "294",
                            "text": "サービス提供責任者(福祉)"
                        },
                        {
                            "value": "295",
                            "text": "ケアマネージャ"
                        },
                        {
                            "value": "296",
                            "text": "その他の福祉関連職"
                        }
                    ]
                },
                {
                    "text": "保育",
                    "value": "53",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "297",
                            "text": "保育士"
                        },
                        {
                            "value": "298",
                            "text": "幼稚園教諭"
                        },
                        {
                            "value": "299",
                            "text": "ベビーシッター"
                        },
                        {
                            "value": "300",
                            "text": "その他の保育関連職"
                        }
                    ]
                }
            ]
        }
    },
    "14": {
        "value": "14",
        "text": "専門職(コンサル・金融・不動産など)",
        "data": {
            "text": "専門職(コンサル・金融・不動産など)",
            "value": "14",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "ビジネスコンサルタント・シンクタンク",
                    "value": "54",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "301",
                            "text": "ビジネスコンサルタント"
                        },
                        {
                            "value": "302",
                            "text": "研究員、リサーチャー"
                        },
                        {
                            "value": "303",
                            "text": "その他のコンサルタント関連職"
                        }
                    ]
                },
                {
                    "text": "法律・会計",
                    "value": "55",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "304",
                            "text": "弁護士"
                        },
                        {
                            "value": "305",
                            "text": "弁理士"
                        },
                        {
                            "value": "306",
                            "text": "司法書士"
                        },
                        {
                            "value": "307",
                            "text": "行政書士"
                        },
                        {
                            "value": "308",
                            "text": "公認会計士"
                        },
                        {
                            "value": "309",
                            "text": "税理士"
                        },
                        {
                            "value": "310",
                            "text": "その他の法律・会計関連職"
                        }
                    ]
                },
                {
                    "text": "金融専門職",
                    "value": "56",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "311",
                            "text": "ファンドマネージャ"
                        },
                        {
                            "value": "312",
                            "text": "金融商品開発・クオンツ・アクチュアリー"
                        },
                        {
                            "value": "313",
                            "text": "投資銀行業務"
                        },
                        {
                            "value": "314",
                            "text": "金融アナリスト・リサーチャー"
                        },
                        {
                            "value": "315",
                            "text": "金融システム企画"
                        },
                        {
                            "value": "316",
                            "text": "その他の金融関連職"
                        }
                    ]
                },
                {
                    "text": "不動産専門職",
                    "value": "57",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "317",
                            "text": "不動産企画・用地仕入れ"
                        },
                        {
                            "value": "318",
                            "text": "不動産鑑定"
                        },
                        {
                            "value": "319",
                            "text": "不動産管理・プロパティマネジャー"
                        },
                        {
                            "value": "320",
                            "text": "ファシリティマネジャー"
                        },
                        {
                            "value": "321",
                            "text": "アセットマネジャー"
                        },
                        {
                            "value": "322",
                            "text": "マンション管理・ビル管理"
                        },
                        {
                            "value": "323",
                            "text": "その他の不動産関連職"
                        }
                    ]
                }
            ]
        }
    },
    "15": {
        "value": "15",
        "text": "その他(公務員、講師など)",
        "data": {
            "text": "その他(公務員、講師など)",
            "value": "15",
            "data": [
                {
                    "text": "選択なし",
                    "value": "0",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        }
                    ]
                },
                {
                    "text": "教育・インストラクター・通訳",
                    "value": "58",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "324",
                            "text": "教師"
                        },
                        {
                            "value": "325",
                            "text": "塾講師・家庭教師"
                        },
                        {
                            "value": "326",
                            "text": "インストラクター"
                        },
                        {
                            "value": "327",
                            "text": "通訳"
                        },
                        {
                            "value": "328",
                            "text": "その他の教育関連職"
                        },
                        {
                            "value": "381",
                            "text": "スクールマネージャー"
                        }
                    ]
                },
                {
                    "text": "公務員・団体職員",
                    "value": "59",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "329",
                            "text": "公務員"
                        },
                        {
                            "value": "330",
                            "text": "団体職員"
                        },
                        {
                            "value": "331",
                            "text": "その他の公務員・団体職員関連職"
                        }
                    ]
                },
                {
                    "text": "その他",
                    "value": "64",
                    "data": [
                        {
                            "value": "0",
                            "text": "選択なし"
                        },
                        {
                            "value": "382",
                            "text": "その他職種"
                        }
                    ]
                }
            ]
        }
    }
}

exports.list_location = {
    "指定なし": "",
    "北海道": "1",
    "青森県": "2",
    "岩手県": "3",
    "宮城県": "4",
    "秋田県": "5",
    "山形県": "6",
    "福島県": "7",
    "茨城県": "8",
    "栃木県": "9",
    "群馬県": "10",
    "埼玉県": "11",
    "千葉県": "12",
    "東京都": "13",
    "神奈川県": "14",
    "新潟県": "15",
    "富山県": "16",
    "石川県": "17",
    "福井県": "18",
    "山梨県": "19",
    "長野県": "20",
    "岐阜県": "21",
    "静岡県": "22",
    "愛知県": "23",
    "三重県": "24",
    "滋賀県": "25",
    "京都府": "26",
    "大阪府": "27",
    "兵庫県": "28",
    "奈良県": "29",
    "和歌山県": "30",
    "鳥取県": "31",
    "島根県": "32",
    "岡山県": "33",
    "広島県": "34",
    "山口県": "35",
    "徳島県": "36",
    "香川県": "37",
    "愛媛県": "38",
    "高知県": "39",
    "福岡県": "40",
    "佐賀県": "41",
    "長崎県": "42",
    "熊本県": "43",
    "大分県": "44",
    "宮崎県": "45",
    "鹿児島県": "46",
    "沖縄県": "47"
  }